## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 17 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| update | `aws_lambda_function.audit_logs`               |
|        | `aws_lambda_function.audit_logs_archiver`      |
|        | `aws_lambda_function.form_archiver`            |
|        | `aws_lambda_function.nagware`                  |
|        | `aws_lambda_function.reliability`              |
|        | `aws_lambda_function.reliability_dlq_consumer` |
|        | `aws_lambda_function.response_archiver`        |
|        | `aws_lambda_function.submission`               |
|        | `aws_lambda_function.vault_integrity`          |
|        | `aws_s3_object.audit_logs_archiver_code`       |
|        | `aws_s3_object.audit_logs_code`                |
|        | `aws_s3_object.form_archiver_code`             |
|        | `aws_s3_object.nagware_code`                   |
|        | `aws_s3_object.reliability_code`               |
|        | `aws_s3_object.reliability_dlq_consumer_code`  |
|        | `aws_s3_object.response_archiver_code`         |
|        | `aws_s3_object.submission_code`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2024-03-15T13:46:13.000+0000" -> (known after apply)
      ~ s3_object_version              = "AUJ430SITKAR0SC.DpjsXdw0iP5ntwXp" -> (known after apply)
      ~ source_code_hash               = "8XJrXQPGK78QNXqkYizyGlH5uM+xYA/x57QzSc/sbKw=" -> "v6M3m8WDyFhaxFTH65Z5DlaoqyhkWntrkGZo+9jUiDo="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs_archiver" {
        id                             = "Audit_Logs_Archiver"
      ~ last_modified                  = "2024-02-20T17:14:02.647+0000" -> (known after apply)
      ~ s3_object_version              = "bMDQzYU6tawp4CUVqctMsk9nqAIirObZ" -> (known after apply)
      ~ source_code_hash               = "j21QkAUTlKxkmkad5xW89Zgl6fwIQ54MWvLhLAnhwdI=" -> "ejiXDWaWHsEG6wKIgbl3ej4m2ORZTvF70Tg8JwhV5mg="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2024-04-09T19:02:51.000+0000" -> (known after apply)
      ~ s3_object_version              = "abRfM2DX7WwemV.SuTE_2Mc9eU0DrDkp" -> (known after apply)
      ~ source_code_hash               = "tZom8NvYkLTCiFBHAx0p97qloJ1ZcMMumoKxxhc4SWc=" -> "1bbzw8umMpgKXaEFRXVu3/NogfyT+Cp2K7w9Mhzz26o="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2024-04-09T19:02:46.000+0000" -> (known after apply)
      ~ s3_object_version              = "KyCYYJA9Gs44WT7Ups8oU49qpGhxfW.k" -> (known after apply)
      ~ source_code_hash               = "ewsERJHdgUqXPuAunXW9Djvue3VCJbRmdbJySbEUXMY=" -> "IJyyF36IMlbq4Ogh127NnaqQC3H6tG3xo97ASwTI4e8="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2024-04-22T14:01:41.000+0000" -> (known after apply)
      ~ s3_object_version              = "kTorjeerPtRM4w1pwNIig3.4D4YxE3JD" -> (known after apply)
      ~ source_code_hash               = "gyCSkTbBtROZbqEOQMsEWTd3X+JXF91xF4ufJrDBrys=" -> "DgCZS8vkQ9AyELRjigX8dlqrgr5JutQWydZ7STmWIfg="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "Reliability_DLQ_Consumer"
      ~ last_modified                  = "2024-02-08T18:31:43.556+0000" -> (known after apply)
      ~ s3_object_version              = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> (known after apply)
      ~ source_code_hash               = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "Yaee/ZU3r2uX8Sh5mVuNs3zkdFxMc4xCCHIuxu+fFVw="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "Response_Archiver"
      ~ last_modified                  = "2024-02-08T18:31:43.601+0000" -> (known after apply)
      ~ s3_object_version              = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> (known after apply)
      ~ source_code_hash               = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> "pnlThMh8i/GpIRhtPpXhl7r9yP8VCpvfi1nkdytUM7s="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2024-03-15T13:46:14.000+0000" -> (known after apply)
      ~ s3_object_version              = "MnDwZ.Kvqsf5nNQdD39DAXo1ypnCEJhj" -> (known after apply)
      ~ source_code_hash               = "DJVk2STondW1jm6Vj61kIHKK8sQw/oCC/75SlBdG3b8=" -> "/T5dl4Rb85djzlEMnJIc5lcH0YNLrqrWp+r0lRHBUr8="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-04-22T14:01:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "PD5RmSEVjAYMZc1lvfSSn6O3RadR+J09hCPKVbQS/+g=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.audit_logs_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_archiver_code" {
        id                     = "audit_logs_archiver_code"
      ~ source_hash            = "j21QkAUTlKxkmkad5xW89Zgl6fwIQ54MWvLhLAnhwdI=" -> "ejiXDWaWHsEG6wKIgbl3ej4m2ORZTvF70Tg8JwhV5mg="
        tags                   = {}
      ~ version_id             = "bMDQzYU6tawp4CUVqctMsk9nqAIirObZ" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "8XJrXQPGK78QNXqkYizyGlH5uM+xYA/x57QzSc/sbKw=" -> "v6M3m8WDyFhaxFTH65Z5DlaoqyhkWntrkGZo+9jUiDo="
        tags                   = {}
      ~ version_id             = "AUJ430SITKAR0SC.DpjsXdw0iP5ntwXp" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.form_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "form_archiver_code" {
        id                     = "form_archiver_code"
      ~ source_hash            = "tZom8NvYkLTCiFBHAx0p97qloJ1ZcMMumoKxxhc4SWc=" -> "1bbzw8umMpgKXaEFRXVu3/NogfyT+Cp2K7w9Mhzz26o="
        tags                   = {}
      ~ version_id             = "abRfM2DX7WwemV.SuTE_2Mc9eU0DrDkp" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.nagware_code will be updated in-place
  ~ resource "aws_s3_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "ewsERJHdgUqXPuAunXW9Djvue3VCJbRmdbJySbEUXMY=" -> "IJyyF36IMlbq4Ogh127NnaqQC3H6tG3xo97ASwTI4e8="
        tags                   = {}
      ~ version_id             = "KyCYYJA9Gs44WT7Ups8oU49qpGhxfW.k" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "gyCSkTbBtROZbqEOQMsEWTd3X+JXF91xF4ufJrDBrys=" -> "DgCZS8vkQ9AyELRjigX8dlqrgr5JutQWydZ7STmWIfg="
        tags                   = {}
      ~ version_id             = "kTorjeerPtRM4w1pwNIig3.4D4YxE3JD" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_dlq_consumer_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_dlq_consumer_code" {
        id                     = "reliability_dlq_consumer_code"
      ~ source_hash            = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "Yaee/ZU3r2uX8Sh5mVuNs3zkdFxMc4xCCHIuxu+fFVw="
        tags                   = {}
      ~ version_id             = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.response_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "response_archiver_code" {
        id                     = "response_archiver_code"
      ~ source_hash            = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> "pnlThMh8i/GpIRhtPpXhl7r9yP8VCpvfi1nkdytUM7s="
        tags                   = {}
      ~ version_id             = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.submission_code will be updated in-place
  ~ resource "aws_s3_object" "submission_code" {
        id                     = "submission_code"
      ~ source_hash            = "DJVk2STondW1jm6Vj61kIHKK8sQw/oCC/75SlBdG3b8=" -> "/T5dl4Rb85djzlEMnJIc5lcH0YNLrqrWp+r0lRHBUr8="
        tags                   = {}
      ~ version_id             = "MnDwZ.Kvqsf5nNQdD39DAXo1ypnCEJhj" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN -...
```

</details>
